In [2]:
import pandas as pd
import numpy as np
import random

In [ ]:
# 1 ¿Qué diferencia hay entre una Serie y un DataFrame?

# Serie: Unidimensional, un tipo de dato, indice por etiquetas
# Data Frame: Bidimensional, multiplos datos, indexacion numerica

In [ ]:
#2 Es el turno de los DataFrames

    # Crea un array de dos dimensiones con 4 filas y 3 columnas.
    # Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".
    # Descarga el archivo "medallas" y carga el DataFrame.

arr1 = np.random.randint(0,100, (4,3))
arr1

colunas = ["España", "Francia" ,"Italia"]

arr2 = pd.DataFrame(arr1, columns = colunas)
arr2

medallas = pd.read_csv('medallas.csv', index_col=0)
print(medallas)

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [30]:
    # Usando el loc extrae todas las columnas de la fila de Tailandia.
    # Usando el loc extrae todas las columnas de China e Irán.
    # Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
    
medallas.loc[7]
medallas.loc[[1,4]] # selecciona dos columnas

columnas2 = ["Oro", "Plata", "Bronce"]
medallas.loc[[1,4], columnas2]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

In [37]:
    # Usando el iloc extrae la información de la India. Devolved todas las columnas.
    # Usando el iloc extrae todas las columnas de los países que estén en posición impar.
    #   La primera que nos tendría que salir es Japón y la última Corea del Norte.
    # Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

medallas

medallas.iloc[5]

medallas.iloc[1::2] #filas pares
medallas.iloc[1::2, 1:4]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

In [51]:
    # Contesta a las siguientes preguntas:
    # ¿Qué país consiguió más de 200 medallas de oro?
    # ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
    # ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?
    
medallas.loc[medallas['Oro'] > 200, :]
medallas.iloc[list((medallas.Oro > 200) & (medallas['Plata'] > 1000)),:] 
#na coluna se puede leer tanto con lo nombre directamente o por su nombre entre corchetes

medallas.iloc[list((medallas.Oro > 200) | (medallas['Bronce'] > 700)),:]

            País   Oro  Plata  Bronce
1          China  1473    994     720
2          Japón  1032   1037     985
3  Corea del Sur   745    663     827

In [64]:
    # Crea una nueva columna que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.
    # Momento de trabajar con Series. Contesta a las siguientes preguntas:
    # Crea dos listas:
    # Una que se llame "valores" que tenga 7 números aleatorios.
    # Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

medallas['Total']=medallas['Oro']+medallas['Plata']+medallas['Bronce']

valores=np.random.randint(1,20,(7))
valores

indices=['lunes', 'martes', 'miercules', 'jueves', 'viernes', 'sabado', 'domingo']
indices

['lunes', 'martes', 'miercules', 'jueves', 'viernes', 'sabado', 'domingo']

In [ ]:
    # A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie 
    # y la variable indices sean los índices de la Serie.
    # A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip 
    # que nos permite iterar por dos listas a la vez. Más información sobre este método aquí.
    # Crea una Serie con el diccionario creado en el punto anterior.


serie1 = pd.Series(valores, indices)
serie1

lunes        12
martes       12
miercules    16
jueves        8
viernes      15
sabado        7
domingo       8
dtype: int32

In [ ]:
dicc = zip(valores, indices)

In [ ]:
    # ¿Qué forma tiene esta última Serie?
    # ¿Qué tipo de datos tiene?
    # ¿Qué tamaño tiene?
    # ¿Cuáles son los índices de la Serie?

In [ ]:
    # ¿Y los values?
    # Extrae el valor para el índice "lunes"
    # Extrae el valor para el índice "lunes", "martes" y "miércoles".
    # Extrae el valor para el índice "lunes" y "domingo".